'''
 *
 * Για εκτέλεση του προγράμματος:
 *    python paradeigma.py
 *
 * Αποτέλεσμα:
 *  Γεια σου, κόσμε!
 *  Εκτέλεση if: Αληθές και όχι ψευδές!
 *  Εκτέλεση βρόγχου: 0 1 2 3 4 5 6 7 8 9
 *  Αυτή είναι μια υπορουτίνα με αριθμό 5.
'''

def subroutine(number):
   print("Αυτή είναι μια υπορουτίνα με αριθμό %d." % number)

i = 0 

print("Γεια σου, κόσμε!\n")

if 1:
    print("Εκτέλεση if: Αληθές και όχι ψευδές!\n")

print("Εκτέλεση βρόγχου: ")

for i in range(0, 10):
    print("%d " % i, end='')

print("\n")

if __name__ == "__main__":
   subroutine(5)
